
<img class="rounded float-start me-4"  src="design/anton.jpg" alt="Ганичев Антон Александрович, фото.">
<h2 class="name">Ганичев Антон Александрович.</h2>
<h5>ИТ - инженер / разработчик систем компьютерного зрения</h5>
<hr>

<p>
             Разработчик систем компьютерного зрения. 
Эксперт МИЭМ, преподаватель ВШЭ и МГУ.

Руководит разработкой ИИ проектов в инженерно-математической школе МИЭМ (ВШЭ). Ведет научно-исследовательский семинар «Технологии компьютерного зрения» на ФКН (ВШЭ). Читает курс лекций для аспирантов и магистров МГУ «Нейронные сети и их применение в научных исследованиях».

Ранее разрабатывал системы видео-аналитики, участвовал в проектах ДИТ г. Москвы по  мониторингу движения транспорта. Сооснователь сервиса «FindMyBike». Основатель компании «4x4 Туризм». Один из разработчиков «ПервоЛого».

С отличием окончил МАТИ РГТУ. Опыт разработки ПО более 20 лет.
            </p>

            <h6>Область интересов:</h6>

            <ul>
               

                <li>
                    Online video streaming processing;
                </li>
                <li>
                    Object Detection & Object tracking;
                </li>
                <li>
                    Open vocabulary object detection  / segmentation ;
                </li>
                <li>
                    Model deployment using Docker, ONNX and GRPC.
                </li>
            </ul>

        
        
        
        <h6>Основной технологический стек</h6>
        <p>  
        <span text-center><b>Python / Pytorch / Numpy / OpenCV / linux / git / Docker /grpc </b></span>
        </p>
        
        
        
         <h6>Кроме того:</h6> 
            
           
        <ul>
            <li>  
                Есть значительный опыт разработки web - приложений: PHP / Laravel, backend, REST.
                Может пригодится для быстрого прототипирования в web.
            </li>

            <li>
                Есть опыт разработки на  C++/STL, Java/Android.
            </li>
        </ul>

       
        
        <p style="padding: 10px">    
             Читаю на английском свободно,  говорю хуже. 
        </p>        
        
        <h6>Статус:</h6>
        <p class="">
            
            Рассмариваю предложения от 
            небольших комманд разработчиков решающих этичные задичи в области видеоаналитики или обработке медицинских изображений.
            
            Готов к удаленной и проектной работе. Рекомендации по требованию.
            
        </p>
 
    