
<img class="rounded float-start me-4 profile-photo" src="design/anton.jpg" alt="Ганичев Антон Александрович, фото.">
<h1 class="name">Ганичев Антон Александрович</h1>
<h2 class="subtitle">ИТ‑инженер · разработчик систем компьютерного зрения</h2>
<hr>

<p>
    Разработчик систем компьютерного зрения. 
    Эксперт МИЭМ, преподаватель ВШЭ и МГУ.

    Руководит разработкой ИИ‑проектов в инженерно‑математической школе МИЭМ (ВШЭ).
    Ведет научно‑исследовательский семинар «Технологии компьютерного зрения» на ФКН (ВШЭ).
    Читает курс лекций для аспирантов и магистров МГУ «Нейронные сети и их применение в научных исследованиях».

    Ранее разрабатывал системы видеоаналитики, участвовал в проектах ДИТ г. Москвы по мониторингу движения транспорта.
    Сооснователь сервиса «FindMyBike». Основатель компании «4x4 Туризм». Один из разработчиков «ПервоЛого».

    С отличием окончил МАТИ РГТУ. Опыт разработки ПО более 20 лет.
            </p>

            <h6>Область интересов:</h6>

            <ul>
               

                <li>
                    Online video streaming processing
                </li>
                <li>
                    Object detection and tracking
                </li>
                <li>
                    Open-vocabulary detection and segmentation
                </li>
                <li>
                    Model deployment using Docker, ONNX, and gRPC
                </li>
            </ul>

        
        
        
        <h6>Основной технологический стек</h6>
        <p>  
        <span text-center><b>Python / PyTorch / NumPy / OpenCV / Linux / Git / Docker / gRPC</b></span>
        </p>
        
        
        
         <h6>Кроме того:</h6> 
            
           
        <ul>
            <li>  
                Есть значительный опыт разработки web‑приложений: PHP / Laravel, backend, REST.
                Может пригодиться для быстрого прототипирования в web.
            </li>

            <li>
                Есть опыт разработки на C++/STL, Java/Android.
            </li>
        </ul>

       
        
        <p class="note">    
             Читаю на английском свободно, говорю хуже. 
        </p>        
        
        <h6>Статус:</h6>
        <p class="">
            
            Рассматриваю предложения от небольших команд разработчиков, решающих этичные задачи
            в области видеоаналитики или обработки медицинских изображений.
            
            Готов к удаленной и проектной работе. Рекомендации по требованию.
            
        </p>
 
    
