
    
    <div class="col-md-8 ">
    <h1 class="name">Ганичев Антон Александрович.</h1>
        <h3>ИТ - инженер / разработчик систем компьютерного зрения</h3>
        <hr>
        <div class="intro-text">
            <p>
                
                Разработчик систем компьютерного зрения. 
Эксперт МИЭМ, преподаватель ВШЭ и МГУ.

Руководит разработкой ИИ проектов в инженерно-математической школе МИЭМ (ВШЭ). Ведет научно-исследовательский семинар «Технологии компьютерного зрения» на ФКН (ВШЭ). Читает курс лекций для аспирантов и магистров МГУ «Нейронные сети и их применение в научных исследованиях».

Ранее разрабатывал системы видео-аналитики, участвовал в проектах ДИТ г. Москвы по  мониторингу движения транспорта. Сооснователь сервиса «FindMyBike». Основатель компании «4x4 Туризм». Один из разработчиков «ПервоЛого».

С отличием окончил МАТИ РГТУ. Опыт разработки ПО более 20 лет.
<!--
                <a href="{{ route('education') }}"><b>Профессиональное ИТ образование: МАТИ РГТУ каф. «Информационные технологии» </b></a>
                <br>
                <a href="{{ route('experience') }}"><b>Опыт разработки с 1997г.</b></a>
-->
            </p>


                Специализируюсь на разработке систем компьютерного зрения (Computer Vision):

            <ul>
                <li>
                Обработкой потокового видео online;
                </li>
                <li>
                Детектирование объектов в видеопотоке;
                </li>
                <li>
                Трекинг объектов;
                </li>
                <li>
                Распознавание / сегментация/ классификация / извлечение признаков / сравнение объектов, 
                </li>
                <li>
                Разворачиванием моделей с использованием ONNX и TensorRT.
                </li>
            </ul>

            Знаком с современными технологиями для извлечения информации из изображений и видео:
            <ul>
                <li>
                    Классификаторы: Resnet -*,DenseNet, MobileNet
                </li>
                <li>
                    Детектирование/сегментация: tinyYolo, YOLOv3, YOLACT, Fr-RCNN, UNET,DeepLab
                </li>
                <li>
                    Распознавание действий на видео ResNet3D/2+1 
                </li>
                <li>
                    Распознавание объектов: / landmark detection / pose estimation , embedding ,  TripletLoss ...
                </li>
            </ul>

        </div>   
    </div>
    <div class="col-md-12 ">

        Основной технологический стек:

        <h4 text-center><b>Python / Pytorch / Numpy / OpenCV / linux / git / Docker  </b></h4>
        <i>
            <p class="small">
            Кроме того: 
            </p>
            <ul class="small">
                <li> есть значительный опыт разработки web - приложений: PHP / Laravel, backend, REST.
                Может пригодится для быстрого прототипирования в web.
                </li>

                <li>
                    есть опыт разработки на  C++/STL, Java/Android.
                </li>
            </ul>

            <p class="small">
                Владею основными паттернами OOП,  понимаю как писать код который можно тестировать.
                Знаком с фреймворками тестирования: xUnit, google_test, Selenium ...


                Могу писать код на javaScript и Jquery, понимаю как устроен HTML и CSS.<br>
                Знаком с:  C#, Visual Basic, AutoIt, Bootstrap, MySQL, Sikuli, Delphi, Matlab, Logo ...
            </p>   
        </i>
        <p style="padding: 10px">    
            Читаю на английском свободно,  говорю хуже. 
        </p>

    </div>   

    <div class="col-md-12 project">
        <h3>Статус:</h3>
        <p class="">
            
            Рассмариваю предложения от 
            небольших комманд разработчиков решающих этичные задичи в области видеоаналитики или обработке медицинских изображений.
            
            Готов к удаленной и проектной работе. Рекомендации по требованию.
                        
        </p>
    </div>   


    